In [1]:
from sql_conn import *

## Establishing sqlite connection
if no database name is specified the default is 'in memory'

In [2]:
sc = SqlConn()

In memory Connection established successfully

In [3]:
sc.query("""
        select CURRENT_TIME, CURRENT_DATE, CURRENT_TIMESTAMP
""")

  CURRENT_TIME CURRENT_DATE    CURRENT_TIMESTAMP
0     20:34:13   2020-10-04  2020-10-04 20:34:13

In [4]:
sc.query("""
        select date('2018-12-01')
""")

  date(&#39;2018-12-01&#39;)
0         2018-12-01

In [5]:
df = pd.read_pickle("data/AlleghenyCountyPropertySaleTransactions.pkl", compression='bz2')

## Uploading a Panda Dataframe to a table

In [6]:
sc.upload(df,"property_sale")

Upload succsessful

## Running queries

In [7]:
sc.query("""
        select * from 
        (select PROPERTYCITY, count(*) as CNT from property_sale  group by 1 )
        order by cnt desc          
        limit 10
        """)

    PROPERTYCITY     CNT
0     PITTSBURGH  160922
1     CORAOPOLIS   10359
2    MC KEESPORT    9104
3       GIBSONIA    6698
4      SEWICKLEY    6282
5  MC KEES ROCKS    6131
6        WEXFORD    6056
7    BETHEL PARK    5849
8    MONROEVILLE    5428
9       CARNEGIE    5209

In [8]:
sc.query(" drop table if exists sales_counts")
sc.query(""" create table sales_counts as 
        select * from 
        (select PROPERTYCITY, count(*) as CNT from property_sale  group by 1 )
        order by CNT desc          
        """)

## Saving to csv

In [9]:
sc.to_csv( table_name='sales_counts', csv_file_name='data/sales.csv')

TypeError: to_csv() got an unexpected keyword argument &#39;csv_file_name&#39;

## Reading from a csv and storing in a table

In [18]:
sc.upload_csv(file_name='data/sales.csv', table_name='sales')

Upload succsessful

In [19]:
sc.query("select * from sales limit 5")

  PROPERTYCITY     CNT
0   PITTSBURGH  160922
1   CORAOPOLIS   10359
2  MC KEESPORT    9104
3     GIBSONIA    6698
4    SEWICKLEY    6282

In [20]:
sc.quit()

database connection successfully closed